<template>
    <b-alert variant="info" :show="true">
        <b>Что делать если макет не подходит под мое гражданство или у меня нет паспорта?</b>
        <p>
            1. Если для Вашего гражданства не подходит макет в форме добавления, заполните его в свободной форме.
            Обязательные поля, которых нет в Вашем регионе, заполните символом "-" (тире). В разделе
            <b>Документы</b>, далее, Вам будет
            необходимо прикрепить скан-копию паспорта.
        </p>
        <p>
            2. Если Ваше гражданство "Украина" или другое, в котором паспорт Выдают в 16 лет, не заполняйте данную
            страницу. Прикрепите копию
            свидетельства о рождении в разделе <b>Документы</b> и обазятельно сообщите нам об этом, используя чат с
            приемной комиссией или
            номер горячей линии!
        </p>
    </b-alert>
</template>

<script lang="ts">
import {Component, Vue} from "vue-property-decorator";

@Component
export default class GuideAdmissionPassport extends Vue {

}
</script>

<style scoped>

</style>