<template>
    <div class="view-ProfileBoardTab">
        <b-alert variant="warning" :show="true" class="mb-3">
            <p>Всем абитуриентам, которые не оформили договор необходимо связаться 28.08.2020 с приемной комиссией по
                телефону <b>+7 (495) 454-13-41</b> до 12:00</p>
        </b-alert>
        <b-alert variant="info" :show="true" class="mb-3">
            <h4>Уважаемые студенты-первокурсники!</h4>
            <p>С первого сентября начинается очное обучение, согласно расписанию, по адресу: Кронштадский б-в, 37Б. В
                8:30 пройдет торжественная линейка на территории коледжа (на улице).
                При себе иметь тетрадь и ручку.</p>
            <p>Расписание и списки групп будут опубликованы на сайте колледжа (http://kip.fa.ru/) 31 августа.</p>
            <p>В целях проведения профилактики инфекицонных болезней и новой коронавирусной инфекции (COVID-19), Вам
                необходимо приходить в колледж в средствах индивидуальной защиты (масках).
                Студенты – иностранные граждане допускаются к учебному процессу после 14-дневной (со дня въезда в
                Российскую Федерацию) изоляции, с проведением на 10-12 день обследования на COVID-19 методом ПЦР.
                Родительское собрание будет проходить в дистанционном формате 03.09.2020 в 16:00 в виде прямой
                трансляции в официальной группе Вконтакте «КИПФИН | Колледж информатики и программирования»
                (https://vk.com/kip_college).</p>
            <div class="my-2">С 01.09.2020 по 08.09.2020 студентам первого курса необходимо предоставить классным
                руководителям следующие документы:
                <ul>
                    <li>Медицинская справка по форме №086/у (с указанием групп здоровья – медицинской [I, II, …] и
                        физкультурной группы [основная, подготовоительная, специальная]);
                    </li>
                    <li>Копию медицинского страхового полиса;</li>
                    <li>СНИЛС при наличии.</li>
                </ul>
            </div>
            <p>Студентам первого курса необходимо предоставить документы, подтвержающие социальный статус (инвалид,
                ребенок-сирота и др.), заместителю директора Новокшоновой Елене Валерьевне в каб. 216
                Оригиналы аттестата будут приниматься со 2 сентября в кабинете 301.</p>
            <p>Ждем Вас с хорошим настроением!</p>

        </b-alert>
        <b-alert variant="danger" :show="true">
            <h4>Уважаемые абитуриенты!</h4>
            <p>Закончен прием документов для поступления на бюджетную основу.</p>
            <p>
                26.08.2020 состоится заседание приемной комиссии на которое будут приглашены студенты имеющие одинаковый
                балл аттестата [спорная ситуация] (находящиеся в конце списка предзачисление) и претендующие на зачисление на бюджет.
            </p>
            <hr />
            <p>
                <b>Спорная ситуация</b>. Например, на Программирование в компьютерных системах 100 бюджетных мест.
                На 100-ом месте абитуриент с 4.6, на 101 с 4.6, и на 102 с 4.6 - такая ситуация называется <b>спорной</b>.
                Если Вы попали в неё, ожидайте звонка!
            </p>
        </b-alert>
        <b-alert variant="warning" :show="true" class="mb-3">
            <h4>Уважаемые абитуриенты!</h4>
            <p>
                Для зачисления в Колледж информатики и программирования на бюджетную основу обучения Вам
                необходимо <b>загрузить
                уведомление в личный кабинет абитуриента</b> (к ранее поданному заявлению) не позднее 17:00 25
                августа!
            </p>
        </b-alert>
        <b-alert variant="danger" :show="true">
            <h4>Внимание!</h4>
            <p>
                Места на обучение <b>по договору</b> (включая бюджет/договор) закончились! Уведомления,
                отправленные после
                21.07.2020 23:59, не будут приняты! Для получение подробностей звоните в приемную комиссию.
            </p>
            <hr/>
            <p>
                Прием документов <b>на бюджетную основу</b> продолжается!
            </p>
        </b-alert>
    </div>
</template>

<script lang="ts">
import {Component, Vue} from "vue-property-decorator";

/**
 *  The ProfileBoardTab component.
 *  @author diego
 *  @created 21.08.2020 00:08
 */
@Component
export default class ProfileBoardTab extends Vue {

}
</script>

<style scoped>

</style>