<template>
    <div class="view-ProfileBoardTab">
        <b-alert variant="info" :show="true" class="mb-3">
            <h4>Уважаемые студенты-первокурсники!</h4>
            <p>С первого сентября начинается очное обучение, согласно расписанию, по адресу: Кронштадский б-в, 37Б. В
                8:30 пройдет торжественная линейка на территории коледжа (на улице).
                При себе иметь тетрадь и ручку.</p>
            <p>Расписание и списки групп будут опубликованы на сайте колледжа (http://kip.fa.ru/) 31 августа.</p>
            <p>В целях проведения профилактики инфекицонных болезней и новой коронавирусной инфекции (COVID-19), Вам
                необходимо приходить в колледж в средствах индивидуальной защиты (масках).
                Студенты – иностранные граждане допускаются к учебному процессу после 14-дневной (со дня въезда в
                Российскую Федерацию) изоляции, с проведением на 10-12 день обследования на COVID-19 методом ПЦР.
                Родительское собрание будет проходить в дистанционном формате 03.09.2020 в 16:00 в виде прямой
                трансляции в официальной группе Вконтакте «КИПФИН | Колледж информатики и программирования»
                (https://vk.com/kip_college).</p>
            <div class="my-2">С 01.09.2020 по 08.09.2020 студентам первого курса необходимо предоставить классным
                руководителям следующие документы:
                <ul>
                    <li>Медицинская справка по форме №086/у (с указанием групп здоровья – медицинской [I, II, …] и
                        физкультурной группы [основная, подготовоительная, специальная]);
                    </li>
                    <li>Копию медицинского страхового полиса;</li>
                    <li>СНИЛС при наличии.</li>
                </ul>
            </div>
            <p>Студентам первого курса необходимо предоставить документы, подтвержающие социальный статус (инвалид,
                ребенок-сирота и др.), заместителю директора Новокшоновой Елене Валерьевне в каб. 216
                Оригиналы аттестата будут приниматься со 2 сентября в кабинете 301.</p>
            <p>Ждем Вас с хорошим настроением!</p>

        </b-alert>
    </div>
</template>

<script lang="ts">
import {Component, Vue} from "vue-property-decorator";

/**
 *  The ProfileBoardTab component.
 *  @author diego
 *  @created 21.08.2020 00:08
 */
@Component
export default class ProfileBoardTab extends Vue {

}
</script>

<style scoped>

</style>